#親
parents_array = ['レディース','メンズ','ベビー・キッズ','インテリア・住まい・小物','本・音楽・ゲーム','おもちゃ・ホビー・グッズ']

#子
child_array = [
  #レディース
  ['トップス','ジャケット/アウター','パンツ','スカート','ワンピース','靴','ルームウェア/パジャマ','レッグウェア','帽子','バッグ','アクセサリー','ヘアアクセサリー','小物','時計','ウィッグ/エクステ','浴衣/水着','スーツ/フォーマル/ドレス','マタニティ','その他'],
  #メンズ
  ['トップス','ジャケット/アウター','パンツ','靴','バッグ','スーツ','帽子','アクセサリー','小物','時計','水着','レッグウェア','アンダーウェア','その他'],
  #ベビー・キッズ
  ['ベビー服(女の子用) ~95cm','ベビー服(男の子用) ~95cm','ベビー服(男女兼用) ~95cm','キッズ服(女の子用) 100cm~','キッズ服(男の子用) 100cm~','キッズ服(男女兼用) 100cm~','キッズ靴','子ども用ファッション小物','おむつ/トイレ/バス','外出/移動用品','授乳/食事','ベビー家具/寝具/室内用品','おもちゃ','行事/記念品','その他'],
  #インテリア・住まい・小物
  ['キッチン/食器','ベッド/マットレス','ソファ/ソファベッド','椅子/チェア','机/テーブル','収納家具','ラグ/カーペット/マット','カーテン/ブラインド','ライト/照明','寝具','インテリア小物','季節/年中行事','その他'],
  #本・音楽・ゲーム
  ['本','漫画','雑誌','CD','DVD/ブルーレイ','レコード','テレビゲーム'],
  #おもちゃ・ホビー・グッズ
  ['おもちゃ','タレントグッズ','コミック/アニメグッズ','トレーディングカード','フィギュア','楽器/器材','コレクション','ミリタリー','美術品','アート用品','その他'],
]

#孫
grandchild_array = [
  #レディース
    #トップス
    ['Tシャツ/カットソー(半袖/袖なし)','Tシャツ/カットソー(七分/長袖)','シャツ/ブラウス(半袖/袖なし)','シャツ/ブラウス(七分/長袖)','ポロシャツ','キャミソール','タンクトップ','ホルターネック','ニット/セーター','チュニック','カーディガン/ボレロ','アンサンブル','ベスト/ジレ','パーカー','トレーナー/スウェット','ベアトップ/チューブトップ','ジャージ','その他'], 
    #ジャケット/アウター
    ['テーラードジャケット','ノーカラージャケット','Gジャン/デニムジャケット','レザージャケット','ダウンジャケット','ライダースジャケット','ミリタリージャケット','ダウンベスト','ジャンパー/ブルゾン','ポンチョ','ロングコート','トレンチコート','ダッフルコート','ピーコート','チェスターコート','モッズコート','スタジャン','毛皮/ファーコート','スプリングコート','スカジャン','その他'], 
    #パンツ
    ['デニム/ジーンズ','ショートパンツ','カジュアルパンツ','ハーフパンツ','チノパン','ワークパンツ/カーゴパンツ','クロップドパンツ','サロペット/オーバーオール','オールインワン','サルエルパンツ','ガウチョパンツ','その他'],
    #スカート
    ['ミニスカート','ひざ丈スカート','ロングスカート','キュロット','その他'], 
    #ワンピース
    ['ミニワンピース','ひざ丈ワンピース','ロングワンピース','その他'],
    #靴
    ['ハイヒール/パンプス','ブーツ','サンダル','スニーカー','ミュール','モカシン','ローファー/革靴','フラットシューズ/バレエシューズ','長靴/レインシューズ','その他'], 
    #ルームウェア/パジャマ
    ['パジャマ','ルームウェア'], 
    #レッグウェア
    ['ソックス','スパッツ/レギンス','ストッキング/タイツ','レッグウォーマー','その他'], 
    #帽子
    ['ニットキャップ/ビーニー','ハット','ハンチング/ベレー帽','キャップ','キャスケット','麦わら帽子','その他'], 
    #バッグ
    ['ハンドバッグ','トートバッグ','エコバッグ','リュック/バックパック','ボストンバッグ','スポーツバッグ','ショルダーバッグ','クラッチバッグ','ポーチ/バニティ','ボディバッグ/ウェストバッグ','マザーズバッグ','メッセンジャーバッグ','ビジネスバッグ','旅行用バッグ/キャリーバッグ','ショップ袋','和装用バッグ','かごバッグ','その他'], 
    #アクセサリー
    ['ネックレス','ブレスレット','バングル/リストバンド','リング','ピアス(片耳用)','ピアス(両耳用)','イヤリング','アンクレット','ブローチ/コサージュ','チャーム','その他'], 
    #ヘアアクセサリー
    ['ヘアゴム/シュシュ','ヘアバンド/カチューシャ','ヘアピン','その他'], 
    #小物
    ['長財布','折り財布','コインケース/小銭入れ','名刺入れ/定期入れ','キーケース','キーホルダー','手袋/アームカバー','ハンカチ','ベルト','マフラー/ショール','ストール/スヌード','バンダナ/スカーフ','ネックウォーマー','サスペンダー','サングラス/メガネ','モバイルケース/カバー','手帳','イヤマフラー','傘','レインコート/ポンチョ','ミラー','タバコグッズ','その他'], 
    #時計
    ['腕時計(アナログ)','腕時計(デジタル)','ラバーベルト','レザーベルト','金属ベルト','その他'], 
    #ウィッグ/エクステ
    ['前髪ウィッグ','ロングストレート','ロングカール','ショートストレート','ショートカール','その他'], 
    #浴衣/水着
    ['浴衣','着物','振袖','長襦袢/半襦袢','水着セパレート','水着ワンピース','水着スポーツ用','その他'], 
    #スーツ/フォーマル/ドレス
    ['スカートスーツ上下','パンツスーツ上下','ドレス','パーティーバッグ','シューズ','ウェディング','その他'], 
    #マタニティ
    ['トップス','アウター','インナー','ワンピース','パンツ/スパッツ','スカート','パジャマ','授乳服','その他'], 
    #その他
    ['コスプレ','下着','その他'],
  #メンズ
    #トップス
    ['Tシャツ/カットソー(半袖/袖なし)','Tシャツ/カットソー(七分/長袖)','シャツ','ポロシャツ','タンクトップ','ニット/セーター','パーカー','カーディガン','スウェット','ジャージ','ベスト','その他'],
    #ジャケット/アウター
    ['テーラードジャケット','ノーカラージャケット','Gジャン/デニムジャケット','レザージャケット','ダウンジャケット','ライダースジャケット','ミリタリージャケット','ナイロンジャケット','フライトジャケット','ダッフルコート','ピーコート','ステンカラーコート','トレンチコート','モッズコート','チェスターコート','スタジャン','スカジャン','ブルゾン','マウンテンパーカー','ダウンベスト','ポンチョ','カバーオール','その他'],
    #パンツ
    ['デニム/ジーンズ','ワークパンツ/カーゴパンツ','スラックス','チノパン','ショートパンツ','ペインターパンツ','サルエルパンツ','オーバーオール','その他'],
    #靴
    ['スニーカー','サンダル','ブーツ','モカシン','ドレス/ビジネス','長靴/レインシューズ','デッキシューズ','その他'],
    #バッグ
    ['ショルダーバッグ','トートバッグ','ボストンバッグ','リュック/バックパック','ウエストポーチ','ボディーバッグ','ドラムバッグ','ビジネスバッグ','トラベルバッグ','メッセンジャーバッグ','エコバッグ','その他'],
    #スーツ
    ['スーツジャケット','スーツベスト','スラックス','セットアップ','その他'],
    #帽子
    ['キャップ','ハット','ニットキャップ/ビーニー','ハンチング/ベレー帽','キャスケット','サンバイザー','その他'],
    #アクセサリー
    ['ネックレス','ブレスレット','バングル/リストバンド','リング','ピアス(片耳用)','ピアス(両耳用)','アンクレット','その他'],
    #小物
    ['長財布','折り財布','マネークリップ','コインケース/小銭入れ','名刺入れ/定期入れ','キーケース','キーホルダー','ネクタイ','手袋','ハンカチ','ベルト','マフラー','ストール','バンダナ','ネックウォーマー','サスペンダー','ウォレットチェーン','サングラス/メガネ','モバイルケース/カバー','手帳','ストラップ','ネクタイピン','カフリンクス','イヤマフラー','傘','レインコート','ミラー','タバコグッズ','その他'],
    #時計
    ['腕時計(アナログ)','腕時計(デジタル)','ラバーベルト','レザーベルト','金属ベルト','その他'],
    #水着
    ['一般水着','スポーツ用','アクセサリー','その他'],
    #レッグウェア
    ['ソックス','レギンス/スパッツ','レッグウォーマー','その他'],
    #アンダーウェア
    ['トランクス','ボクサーパンツ','その他'],
    #その他
    [],
  #ベビー・キッズ
    #ベビー服(女の子用) ~95cm
    ['トップス','アウター','パンツ','スカート','ワンピース','ベビードレス','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    #ベビー服(男の子用) ~95cm
    ['トップス','アウター','パンツ','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    #ベビー服(男女兼用) ~95cm
    ['トップス','アウター','パンツ','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    #キッズ服(女の子用) 100cm~
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(チュニック)','トップス(タンクトップ)','トップス(その他)','スカート','パンツ','ワンピース','セットアップ','パジャマ','フォーマル/ドレス','和服','浴衣','甚平','水着','その他'],
    #キッズ服(男の子用) 100cm~
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(その他)','パンツ','セットアップ','パジャマ','フォーマル/ドレス','和服','浴衣','甚平','水着','その他'],
    #キッズ服(男女兼用) 100cm~
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(その他)','ボトムス','パジャマ','その他'],
    #キッズ靴
    ['スニーカー','サンダル','ブーツ','長靴','その他'],
    #子ども用ファッション小物
    ['靴下/スパッツ','帽子','エプロン','サスペンダー','タイツ','ハンカチ','バンダナ','ベルト','マフラー','傘','手袋','スタイ','バッグ','その他'],
    #おむつ/トイレ/バス
    ['おむつ用品','おまる/補助便座','トレーニングパンツ','ベビーバス','お風呂用品','その他'],
    #外出/移動用品
    ['ベビーカー','抱っこひも/スリング','チャイルドシート','その他'],
    #授乳/食事
    ['ミルク','ベビーフード','ベビー用食器','その他'],
    #ベビー家具/寝具/室内用品
    ['ベッド','布団/毛布','イス','たんす','その他'],
    #おもちゃ
    ['おふろのおもちゃ','がらがら','オルゴール','ベビージム','手押し車/カタカタ','知育玩具','その他'],
    #行事/記念品
    ['お宮参り用品','お食い初め用品','アルバム','手形/足形','その他'],
    #その他
    ['母子手帳用品','その他'],
  #インテリア・住まい・小物
    #キッチン/食器
    ['食器','調理器具','収納/キッチン雑貨','弁当用品','カトラリー(スプーン等)','テーブル用品','容器','エプロン','アルコールグッズ','浄水機','その他'],
    #ベッド/マットレス
    ['セミシングルベッド','シングルベッド','セミダブルベッド','ダブルベッド','ワイドダブルベッド','クイーンベッド','キングベッド','脚付きマットレスベッド','マットレス','すのこベッド','ロフトベッド/システムベッド','簡易ベッド/折りたたみベッド','収納付き','その他'],
    #ソファ/ソファベッド
    ['ソファセット','シングルソファ','ラブソファ','トリプルソファ','オットマン','コーナーソファ','ビーズソファ/クッションソファ','ローソファ/フロアソファ','ソファベッド','応接セット','ソファカバー','リクライニングソファ','その他'],
    #椅子/チェア
    ['一般','スツール','ダイニングチェア','ハイバックチェア','ロッキングチェア','座椅子','折り畳みイス','デスクチェア','その他'],
    #机/テーブル
    ['こたつ','カウンターテーブル','サイドテーブル','センターテーブル','ダイニングテーブル','座卓/ちゃぶ台','アウトドア用','パソコン用','事務机/学習机','その他'],
    #収納家具
    ['リビング収納','キッチン収納','玄関/屋外収納','バス/トイレ収納','本収納','本/CD/DVD収納','洋服タンス/押入れ収納','電話台/ファックス台','ドレッサー/鏡台','棚/ラック','ケース/ボックス','その他'],
    #ラグ/カーペット/マット
    ['ラグ','カーペット','ホットカーペット','玄関/キッチンマット','トイレ/バスマット','その他'],
    #カーテン/ブラインド
    ['カーテン','ブラインド','ロールスクリーン','のれん','その他'],
    #ライト/照明
    ['蛍光灯/電球','天井照明','フロアスタンド','その他'],
    #寝具
    ['布団/毛布','枕','シーツ/カバー','その他'],
    #インテリア小物
    ['ごみ箱','ウェルカムボード','オルゴール','クッション','クッションカバー','スリッパラック','ティッシュボックス','バスケット/かご','フォトフレーム','マガジンラック','モビール','花瓶','灰皿','傘立て','小物入れ','置時計','掛時計/柱時計','鏡(立て掛け式)','鏡(壁掛け式)','置物','風鈴','植物/観葉植物','その他'],
    #季節/年中行事
    ['正月','成人式','バレンタインデー','ひな祭り','子どもの日','母の日','父の日','サマーギフト/お中元','夏/夏休み','ハロウィン','敬老の日','七五三','お歳暮','クリスマス','冬一般','その他'],
    #その他
    [],
  #本・音楽・ゲーム
    #本
    ['文学/小説','人文/社会','ノンフィクション/教養','地図/旅行ガイド','ビジネス/経済','健康/医学','コンピュータ/IT','趣味/スポーツ/実用','住まい/暮らし/子育て','アート/エンタメ','洋書','絵本','参考書','その他'],
    #漫画
    ['全巻セット','少年漫画','少女漫画','青年漫画','女性漫画','同人誌','その他'],
    #雑誌
    ['アート/エンタメ/ホビー','ファッション','ニュース/総合','趣味/スポーツ','その他'],
    #CD
    ['邦楽','洋楽','アニメ','クラシック','K-POP/アジア','キッズ/ファミリー','その他'],
    #DVD/ブルーレイ
    ['外国映画','日本映画','アニメ','TVドラマ','ミュージック','お笑い/バラエティ','スポーツ/フィットネス','キッズ/ファミリー','その他'],
    #レコード
    ['邦楽','洋楽','その他'],
    #テレビゲーム
    ['家庭用ゲーム本体','家庭用ゲームソフト','携帯用ゲーム本体','携帯用ゲームソフト','PCゲーム','その他'],
  #おもちゃ・ホビー・グッズ
    #おもちゃ
    ['キャラクターグッズ','ぬいぐるみ','小物/アクセサリー','模型/プラモデル','ミニカー','トイラジコン','プラモデル','ホビーラジコン','鉄道模型','その他'],
    #タレントグッズ
    ['アイドル','ミュージシャン','タレント/お笑い芸人','スポーツ選手','その他'],
    #コミック/アニメグッズ
    ['ストラップ','キーホルダー','バッジ','カード','クリアファイル','ポスター','タオル','その他'],
    #トレーディングカード
    ['遊戯王','マジック：ザ・ギャザリング','ポケモンカードゲーム','デュエルマスターズ','バトルスピリッツ','プリパラ','アイカツ','カードファイト!! ヴァンガード','ヴァイスシュヴァルツ','プロ野球オーナーズリーグ','ベースボールヒーローズ','ドラゴンボール','スリーブ','その他'],
    #フィギュア
    ['コミック/アニメ','特撮','ゲームキャラクター','SF/ファンタジー/ホラー','アメコミ','スポーツ','ミリタリー','その他'],
    #楽器/器材
    ['エレキギター','アコースティックギター','ベース','エフェクター','アンプ','弦楽器','管楽器','鍵盤楽器','打楽器','和楽器','楽譜/スコア','レコーディング/PA機器','DJ機器','DTM/DAW','その他'],
    #コレクション
    ['武具','使用済切手/官製はがき','旧貨幣/金貨/銀貨/記念硬貨','印刷物','ノベルティグッズ','その他'],
    #ミリタリー
    ['トイガン','個人装備','その他'],
    #美術品
    ['陶芸','ガラス','漆芸','金属工芸','絵画/タペストリ','版画','彫刻/オブジェクト','書','写真','その他'],
    #アート用品
    ['画材','額縁','その他'],
    #その他
    ['トランプ/UNO','カルタ/百人一首','ダーツ','ビリヤード','麻雀','パズル/ジグソーパズル','囲碁/将棋','オセロ/チェス','人生ゲーム','野球/サッカーゲーム','スポーツ','三輪車/乗り物','ヨーヨー','模型製作用品','鉄道','航空機','アマチュア無線','パチンコ/パチスロ','その他'],
]

parents_array.each do |parent|
  Category.create(name: parent)
end

@parents = Category.where(ancestry: nil)

c = 0
@parents.each do |parent|
  child_array[c].each do |child|
    parent.children.create(name: child)
  end
  c += 1
end

g = 0
@parents.each do |parent|
  index = parent.id
  @children = Category.where(ancestry: index)
  @children.each do |child|
    grandchild_array[g].each do |grandchild|
      child.children.create(name: grandchild)
    end
    g += 1
  end
end

#-----------------------------------
# #親
# parents = ['レディース','メンズ']

# #子
# child_array = [
#   #レディース
#   ['トップス','パンツ'],
#   #メンズ
#   ["Yシャツ"]
# ]

# #孫
# grandchild_array = [
#   #レディース
#   ['Tシャツ','ブラウス'],['スキニー'],
#   #メンズ
#   ['長そで','半そで']
# ]

# parents.each do |parent|
#   Category.create(name: parent)
# end

# @parents = Category.where(ancestry: nil)

# c = 0
# @parents.each do |parent|
#   child_array[c].each do |child|
#     parent.children.create(name: child)
#   end
#   c += 1
# end

# g = 0
# @parents.each do |parent|
#   index = parent.id
#   @children = Category.where(ancestry: index)
#   @children.each do |child|
#     grandchild_array[g].each do |grandchild|
#       child.children.create(name: grandchild)
#     end
#     g += 1
#   end
# end